var x = 6;
var y = 14;
var z = 4;
var result = x += y - x++ * z

document.write("(x += y - x++ * z) = " + result + '<br>');
/*
виконання:
1.перша дія множення 
x++ * z
'х' в постфіксній формі,тому +1 на цьому кроці не застосовується
6 * 4 = 24 
2.друга дія віднімання
y - (x++ * z)
14 - 24 = -10
3.третя дія додавання
+= скорочена форма від x =  x + y - x++ * z
x += y - x++ * z
6 + -10 =  -4
постфікс не застосовується, 
як я розумію JS компілятор йде з ліва на право й застосовує цифри, 
до першого 'x' присвоїлось 6 швидше ніж присвоєння і  розрахунок дійшли до 'x++'
*/

var x = 6;
var y = 14;
var z = 4;
var result = z = --x - y * 5

document.write("(z = --x - y * 5) = " + result +'<br>');
/*
виконання:
1.перша дія множення
y * 5
14 * 5 = 70
2.друга дія віднімання, 'х' в предекрементній формі, тобто x=6, --x = 5 або 6 - 1 =  5
--x - y * 5
5 - 70 = -65
3.третя дія визначення 'z'
z = -65
*/

var x = 6;
var y = 14;
var z = 4;
var result = y /= x + 5 % z

document.write("(y /= x + 5 % z) = " + result +'<br>');
/*
виконання:
1.перша дія: оператор взяття залишку
5 % z  
5 % 4 = 1 -> один крок щоб поділити число без залишку
2.друга дія додавання
x + 5 % z
6 + 1 = 7
3.третя дія ділення й присвоєння нового значення 'y'
y /= x + 5 % z , тобто y = y/x + 5 % z
14/7 = 2
*/

var x = 6;
var y = 14;
var z = 4;
var result = z - x++ + y * 5

document.write("(z - x++ + y * 5) = " + result + '<br>');
/*
виконання:
1.перша дія множення
y * 5
14 * 5 = 70 
2.друга дія віднімання
z - x++
4 - 6 = -2
3.третя дія додавання
z - x++ + y * 5
70 - -2 = 68
*/

var x = 6;
var y = 14;
var z = 4;
var result = x = y - x++ * z

document.write("(x = y - x++ * z) = " + result + '<br>');
/*
виконання:
1.перша дія множення, 'х' в постфіксній формі,тому +1 на цьому кроці не застосовується
x++ * z
6 * 4 = 24
2.друга дія віднімання
y - x++ * z
14 - 24 = -10
3.третя дія присвоєння 'x' нового значення
x = y - x++ * z
x = -10
*/